; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-5-4-9)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	s10 - location
	s11 - location
	s12 - location
	s13 - location
	p0-5 - location
	p0-12 - location
	p1-2 - location
	p1-4 - location
	p1-13 - location
	p2-0 - location
	p2-10 - location
	p3-2 - location
	p3-7 - location
	p4-1 - location
	p4-8 - location
	p4-9 - location
	p5-2 - location
	p5-13 - location
	p7-0 - location
	p7-1 - location
	p8-11 - location
	p9-2 - location
	p9-5 - location
	p10-3 - location
	p10-5 - location
	p11-4 - location
	p11-6 - location
	p11-13 - location
	p12-2 - location
	p12-3 - location
	p12-10 - location
	p13-2 - location
	p13-6 - location
	)
	(:init
	(at driver1 s8)
	(at driver2 s13)
	(at driver3 s1)
	(at driver4 s0)
	(at driver5 s5)
	(at truck1 s11)
	(empty truck1)
	(at truck2 s11)
	(empty truck2)
	(at truck3 s6)
	(empty truck3)
	(at truck4 s1)
	(empty truck4)
	(at package1 s6)
	(at package2 s10)
	(at package3 s1)
	(at package4 s9)
	(at package5 s0)
	(at package6 s1)
	(at package7 s3)
	(at package8 s3)
	(at package9 s9)
	(path s0 p0-5)
	(path p0-5 s0)
	(path s5 p0-5)
	(path p0-5 s5)
	(= (time-to-walk s0 p0-5) 8)
	(= (time-to-walk p0-5 s0) 8)
	(= (time-to-walk s5 p0-5) 66)
	(= (time-to-walk p0-5 s5) 66)
	(path s0 p0-12)
	(path p0-12 s0)
	(path s12 p0-12)
	(path p0-12 s12)
	(= (time-to-walk s0 p0-12) 33)
	(= (time-to-walk p0-12 s0) 33)
	(= (time-to-walk s12 p0-12) 76)
	(= (time-to-walk p0-12 s12) 76)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(= (time-to-walk s1 p1-2) 11)
	(= (time-to-walk p1-2 s1) 11)
	(= (time-to-walk s2 p1-2) 62)
	(= (time-to-walk p1-2 s2) 62)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(= (time-to-walk s1 p1-4) 100)
	(= (time-to-walk p1-4 s1) 100)
	(= (time-to-walk s4 p1-4) 85)
	(= (time-to-walk p1-4 s4) 85)
	(path s1 p1-13)
	(path p1-13 s1)
	(path s13 p1-13)
	(path p1-13 s13)
	(= (time-to-walk s1 p1-13) 54)
	(= (time-to-walk p1-13 s1) 54)
	(= (time-to-walk s13 p1-13) 31)
	(= (time-to-walk p1-13 s13) 31)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(= (time-to-walk s2 p2-0) 96)
	(= (time-to-walk p2-0 s2) 96)
	(= (time-to-walk s0 p2-0) 42)
	(= (time-to-walk p2-0 s0) 42)
	(path s2 p2-10)
	(path p2-10 s2)
	(path s10 p2-10)
	(path p2-10 s10)
	(= (time-to-walk s2 p2-10) 57)
	(= (time-to-walk p2-10 s2) 57)
	(= (time-to-walk s10 p2-10) 65)
	(= (time-to-walk p2-10 s10) 65)
	(path s3 p3-2)
	(path p3-2 s3)
	(path s2 p3-2)
	(path p3-2 s2)
	(= (time-to-walk s3 p3-2) 40)
	(= (time-to-walk p3-2 s3) 40)
	(= (time-to-walk s2 p3-2) 69)
	(= (time-to-walk p3-2 s2) 69)
	(path s3 p3-7)
	(path p3-7 s3)
	(path s7 p3-7)
	(path p3-7 s7)
	(= (time-to-walk s3 p3-7) 68)
	(= (time-to-walk p3-7 s3) 68)
	(= (time-to-walk s7 p3-7) 45)
	(= (time-to-walk p3-7 s7) 45)
	(path s4 p4-8)
	(path p4-8 s4)
	(path s8 p4-8)
	(path p4-8 s8)
	(= (time-to-walk s4 p4-8) 85)
	(= (time-to-walk p4-8 s4) 85)
	(= (time-to-walk s8 p4-8) 80)
	(= (time-to-walk p4-8 s8) 80)
	(path s4 p4-9)
	(path p4-9 s4)
	(path s9 p4-9)
	(path p4-9 s9)
	(= (time-to-walk s4 p4-9) 88)
	(= (time-to-walk p4-9 s4) 88)
	(= (time-to-walk s9 p4-9) 19)
	(= (time-to-walk p4-9 s9) 19)
	(path s5 p5-2)
	(path p5-2 s5)
	(path s2 p5-2)
	(path p5-2 s2)
	(= (time-to-walk s5 p5-2) 7)
	(= (time-to-walk p5-2 s5) 7)
	(= (time-to-walk s2 p5-2) 17)
	(= (time-to-walk p5-2 s2) 17)
	(path s5 p5-13)
	(path p5-13 s5)
	(path s13 p5-13)
	(path p5-13 s13)
	(= (time-to-walk s5 p5-13) 90)
	(= (time-to-walk p5-13 s5) 90)
	(= (time-to-walk s13 p5-13) 33)
	(= (time-to-walk p5-13 s13) 33)
	(path s7 p7-0)
	(path p7-0 s7)
	(path s0 p7-0)
	(path p7-0 s0)
	(= (time-to-walk s7 p7-0) 26)
	(= (time-to-walk p7-0 s7) 26)
	(= (time-to-walk s0 p7-0) 99)
	(= (time-to-walk p7-0 s0) 99)
	(path s7 p7-1)
	(path p7-1 s7)
	(path s1 p7-1)
	(path p7-1 s1)
	(= (time-to-walk s7 p7-1) 1)
	(= (time-to-walk p7-1 s7) 1)
	(= (time-to-walk s1 p7-1) 80)
	(= (time-to-walk p7-1 s1) 80)
	(path s8 p8-11)
	(path p8-11 s8)
	(path s11 p8-11)
	(path p8-11 s11)
	(= (time-to-walk s8 p8-11) 33)
	(= (time-to-walk p8-11 s8) 33)
	(= (time-to-walk s11 p8-11) 8)
	(= (time-to-walk p8-11 s11) 8)
	(path s9 p9-2)
	(path p9-2 s9)
	(path s2 p9-2)
	(path p9-2 s2)
	(= (time-to-walk s9 p9-2) 45)
	(= (time-to-walk p9-2 s9) 45)
	(= (time-to-walk s2 p9-2) 66)
	(= (time-to-walk p9-2 s2) 66)
	(path s9 p9-5)
	(path p9-5 s9)
	(path s5 p9-5)
	(path p9-5 s5)
	(= (time-to-walk s9 p9-5) 84)
	(= (time-to-walk p9-5 s9) 84)
	(= (time-to-walk s5 p9-5) 55)
	(= (time-to-walk p9-5 s5) 55)
	(path s10 p10-3)
	(path p10-3 s10)
	(path s3 p10-3)
	(path p10-3 s3)
	(= (time-to-walk s10 p10-3) 28)
	(= (time-to-walk p10-3 s10) 28)
	(= (time-to-walk s3 p10-3) 83)
	(= (time-to-walk p10-3 s3) 83)
	(path s10 p10-5)
	(path p10-5 s10)
	(path s5 p10-5)
	(path p10-5 s5)
	(= (time-to-walk s10 p10-5) 40)
	(= (time-to-walk p10-5 s10) 40)
	(= (time-to-walk s5 p10-5) 82)
	(= (time-to-walk p10-5 s5) 82)
	(path s11 p11-4)
	(path p11-4 s11)
	(path s4 p11-4)
	(path p11-4 s4)
	(= (time-to-walk s11 p11-4) 14)
	(= (time-to-walk p11-4 s11) 14)
	(= (time-to-walk s4 p11-4) 36)
	(= (time-to-walk p11-4 s4) 36)
	(path s11 p11-6)
	(path p11-6 s11)
	(path s6 p11-6)
	(path p11-6 s6)
	(= (time-to-walk s11 p11-6) 23)
	(= (time-to-walk p11-6 s11) 23)
	(= (time-to-walk s6 p11-6) 70)
	(= (time-to-walk p11-6 s6) 70)
	(path s11 p11-13)
	(path p11-13 s11)
	(path s13 p11-13)
	(path p11-13 s13)
	(= (time-to-walk s11 p11-13) 1)
	(= (time-to-walk p11-13 s11) 1)
	(= (time-to-walk s13 p11-13) 63)
	(= (time-to-walk p11-13 s13) 63)
	(path s12 p12-2)
	(path p12-2 s12)
	(path s2 p12-2)
	(path p12-2 s2)
	(= (time-to-walk s12 p12-2) 38)
	(= (time-to-walk p12-2 s12) 38)
	(= (time-to-walk s2 p12-2) 68)
	(= (time-to-walk p12-2 s2) 68)
	(path s12 p12-3)
	(path p12-3 s12)
	(path s3 p12-3)
	(path p12-3 s3)
	(= (time-to-walk s12 p12-3) 7)
	(= (time-to-walk p12-3 s12) 7)
	(= (time-to-walk s3 p12-3) 23)
	(= (time-to-walk p12-3 s3) 23)
	(path s12 p12-10)
	(path p12-10 s12)
	(path s10 p12-10)
	(path p12-10 s10)
	(= (time-to-walk s12 p12-10) 48)
	(= (time-to-walk p12-10 s12) 48)
	(= (time-to-walk s10 p12-10) 95)
	(= (time-to-walk p12-10 s10) 95)
	(path s13 p13-2)
	(path p13-2 s13)
	(path s2 p13-2)
	(path p13-2 s2)
	(= (time-to-walk s13 p13-2) 42)
	(= (time-to-walk p13-2 s13) 42)
	(= (time-to-walk s2 p13-2) 54)
	(= (time-to-walk p13-2 s2) 54)
	(path s13 p13-6)
	(path p13-6 s13)
	(path s6 p13-6)
	(path p13-6 s6)
	(= (time-to-walk s13 p13-6) 12)
	(= (time-to-walk p13-6 s13) 12)
	(= (time-to-walk s6 p13-6) 31)
	(= (time-to-walk p13-6 s6) 31)
	(link s0 s10)
	(link s10 s0)
	(= (time-to-drive s0 s10) 86)
	(= (time-to-drive s10 s0) 86)
	(link s0 s11)
	(link s11 s0)
	(= (time-to-drive s0 s11) 37)
	(= (time-to-drive s11 s0) 37)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 30)
	(= (time-to-drive s0 s1) 30)
	(link s1 s3)
	(link s3 s1)
	(= (time-to-drive s1 s3) 87)
	(= (time-to-drive s3 s1) 87)
	(link s1 s6)
	(link s6 s1)
	(= (time-to-drive s1 s6) 16)
	(= (time-to-drive s6 s1) 16)
	(link s2 s8)
	(link s8 s2)
	(= (time-to-drive s2 s8) 62)
	(= (time-to-drive s8 s2) 62)
	(link s2 s9)
	(link s9 s2)
	(= (time-to-drive s2 s9) 95)
	(= (time-to-drive s9 s2) 95)
	(link s3 s2)
	(link s2 s3)
	(= (time-to-drive s3 s2) 61)
	(= (time-to-drive s2 s3) 61)
	(link s3 s5)
	(link s5 s3)
	(= (time-to-drive s3 s5) 28)
	(= (time-to-drive s5 s3) 28)
	(link s3 s11)
	(link s11 s3)
	(= (time-to-drive s3 s11) 78)
	(= (time-to-drive s11 s3) 78)
	(link s3 s13)
	(link s13 s3)
	(= (time-to-drive s3 s13) 15)
	(= (time-to-drive s13 s3) 15)
	(link s4 s2)
	(link s2 s4)
	(= (time-to-drive s4 s2) 55)
	(= (time-to-drive s2 s4) 55)
	(link s4 s11)
	(link s11 s4)
	(= (time-to-drive s4 s11) 61)
	(= (time-to-drive s11 s4) 61)
	(link s4 s12)
	(link s12 s4)
	(= (time-to-drive s4 s12) 55)
	(= (time-to-drive s12 s4) 55)
	(link s5 s0)
	(link s0 s5)
	(= (time-to-drive s5 s0) 37)
	(= (time-to-drive s0 s5) 37)
	(link s5 s2)
	(link s2 s5)
	(= (time-to-drive s5 s2) 74)
	(= (time-to-drive s2 s5) 74)
	(link s6 s2)
	(link s2 s6)
	(= (time-to-drive s6 s2) 90)
	(= (time-to-drive s2 s6) 90)
	(link s6 s5)
	(link s5 s6)
	(= (time-to-drive s6 s5) 59)
	(= (time-to-drive s5 s6) 59)
	(link s6 s7)
	(link s7 s6)
	(= (time-to-drive s6 s7) 44)
	(= (time-to-drive s7 s6) 44)
	(link s6 s11)
	(link s11 s6)
	(= (time-to-drive s6 s11) 91)
	(= (time-to-drive s11 s6) 91)
	(link s7 s0)
	(link s0 s7)
	(= (time-to-drive s7 s0) 21)
	(= (time-to-drive s0 s7) 21)
	(link s7 s3)
	(link s3 s7)
	(= (time-to-drive s7 s3) 82)
	(= (time-to-drive s3 s7) 82)
	(link s7 s11)
	(link s11 s7)
	(= (time-to-drive s7 s11) 59)
	(= (time-to-drive s11 s7) 59)
	(link s8 s1)
	(link s1 s8)
	(= (time-to-drive s8 s1) 28)
	(= (time-to-drive s1 s8) 28)
	(link s8 s6)
	(link s6 s8)
	(= (time-to-drive s8 s6) 4)
	(= (time-to-drive s6 s8) 4)
	(link s8 s7)
	(link s7 s8)
	(= (time-to-drive s8 s7) 6)
	(= (time-to-drive s7 s8) 6)
	(link s8 s9)
	(link s9 s8)
	(= (time-to-drive s8 s9) 22)
	(= (time-to-drive s9 s8) 22)
	(link s8 s12)
	(link s12 s8)
	(= (time-to-drive s8 s12) 45)
	(= (time-to-drive s12 s8) 45)
	(link s9 s1)
	(link s1 s9)
	(= (time-to-drive s9 s1) 59)
	(= (time-to-drive s1 s9) 59)
	(link s9 s4)
	(link s4 s9)
	(= (time-to-drive s9 s4) 33)
	(= (time-to-drive s4 s9) 33)
	(link s9 s10)
	(link s10 s9)
	(= (time-to-drive s9 s10) 76)
	(= (time-to-drive s10 s9) 76)
	(link s9 s12)
	(link s12 s9)
	(= (time-to-drive s9 s12) 45)
	(= (time-to-drive s12 s9) 45)
	(link s10 s1)
	(link s1 s10)
	(= (time-to-drive s10 s1) 70)
	(= (time-to-drive s1 s10) 70)
	(link s10 s4)
	(link s4 s10)
	(= (time-to-drive s10 s4) 5)
	(= (time-to-drive s4 s10) 5)
	(link s10 s11)
	(link s11 s10)
	(= (time-to-drive s10 s11) 31)
	(= (time-to-drive s11 s10) 31)
	(link s12 s11)
	(link s11 s12)
	(= (time-to-drive s12 s11) 86)
	(= (time-to-drive s11 s12) 86)
	(link s13 s2)
	(link s2 s13)
	(= (time-to-drive s13 s2) 67)
	(= (time-to-drive s2 s13) 67)
	(link s13 s4)
	(link s4 s13)
	(= (time-to-drive s13 s4) 25)
	(= (time-to-drive s4 s13) 25)
	(link s13 s9)
	(link s9 s13)
	(= (time-to-drive s13 s9) 46)
	(= (time-to-drive s9 s13) 46)
	(link s13 s11)
	(link s11 s13)
	(= (time-to-drive s13 s11) 95)
	(= (time-to-drive s11 s13) 95)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver1 s0)
	(at driver2 s13)
	(at driver3 s12)
	(at truck1 s5)
	(at truck2 s5)
	(at truck3 s3)
	(at truck4 s13)
	(at package1 s4)
	(at package2 s12)
	(at package3 s12)
	(at package4 s13)
	(at package5 s0)
	(at package6 s6)
	(at package7 s4)
	(at package8 s1)
	(at package9 s7)
	))

(:metric minimize (+ (+ (* 1  (total-time)) (* 3  (driven))) (* 2  (walked))))

)

; plan
1. (load-truck package6 truck4 s1)
   deleted: (at package6 s1)
   added: (in package6 truck4)
   goals met: 2 of 16
2. (walk driver1 s8 p8-11)
   deleted: (at driver1 s8)
   added: (at driver1 p8-11)
   changed: (walked) from 0 to 33
   goals met: 2 of 16
3. (walk driver2 s13 p13-6)
   deleted: (at driver2 s13)
   added: (at driver2 p13-6)
   changed: (walked) from 33 to 45
   goals met: 1 of 16
4. (load-truck package3 truck4 s1)
   deleted: (at package3 s1)
   added: (in package3 truck4)
   goals met: 1 of 16
5. (board-truck driver3 truck4 s1)
   deleted: (at driver3 s1) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 1 of 16
6. (walk driver1 p8-11 s11)
   deleted: (at driver1 p8-11)
   added: (at driver1 s11)
   changed: (walked) from 45 to 53
   goals met: 1 of 16
7. (drive-truck truck4 s1 s9 driver3)
   deleted: (at truck4 s1)
   added: (at truck4 s9)
   changed: (driven) from 0 to 59
   goals met: 1 of 16
8. (load-truck package4 truck4 s9)
   deleted: (at package4 s9)
   added: (in package4 truck4)
   goals met: 1 of 16
9. (walk driver2 p13-6 s6)
   deleted: (at driver2 p13-6)
   added: (at driver2 s6)
   changed: (walked) from 53 to 84
   goals met: 1 of 16
10. (board-truck driver2 truck3 s6)
   deleted: (at driver2 s6) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 1 of 16
11. (load-truck package1 truck3 s6)
   deleted: (at package1 s6)
   added: (in package1 truck3)
   goals met: 1 of 16
12. (load-truck package9 truck4 s9)
   deleted: (at package9 s9)
   added: (in package9 truck4)
   goals met: 1 of 16
13. (drive-truck truck3 s6 s2 driver2)
   deleted: (at truck3 s6)
   added: (at truck3 s2)
   changed: (driven) from 59 to 149
   goals met: 1 of 16
14. (drive-truck truck3 s2 s3 driver2)
   deleted: (at truck3 s2)
   added: (at truck3 s3)
   changed: (driven) from 149 to 210
   goals met: 2 of 16
15. (load-truck package7 truck3 s3)
   deleted: (at package7 s3)
   added: (in package7 truck3)
   goals met: 2 of 16
16. (drive-truck truck4 s9 s10 driver3)
   deleted: (at truck4 s9)
   added: (at truck4 s10)
   changed: (driven) from 210 to 286
   goals met: 2 of 16
17. (load-truck package2 truck4 s10)
   deleted: (at package2 s10)
   added: (in package2 truck4)
   goals met: 2 of 16
18. (drive-truck truck4 s10 s9 driver3)
   deleted: (at truck4 s10)
   added: (at truck4 s9)
   changed: (driven) from 286 to 362
   goals met: 2 of 16
19. (drive-truck truck4 s9 s8 driver3)
   deleted: (at truck4 s9)
   added: (at truck4 s8)
   changed: (driven) from 362 to 384
   goals met: 2 of 16
20. (load-truck package8 truck3 s3)
   deleted: (at package8 s3)
   added: (in package8 truck3)
   goals met: 2 of 16
21. (drive-truck truck4 s8 s12 driver3)
   deleted: (at truck4 s8)
   added: (at truck4 s12)
   changed: (driven) from 384 to 429
   goals met: 2 of 16
22. (unload-truck package2 truck4 s12)
   deleted: (in package2 truck4)
   added: (at package2 s12)
   goals met: 3 of 16
23. (unload-truck package3 truck4 s12)
   deleted: (in package3 truck4)
   added: (at package3 s12)
   goals met: 4 of 16
24. (drive-truck truck3 s3 s13 driver2)
   deleted: (at truck3 s3)
   added: (at truck3 s13)
   changed: (driven) from 429 to 444
   goals met: 3 of 16
25. (drive-truck truck4 s12 s8 driver3)
   deleted: (at truck4 s12)
   added: (at truck4 s8)
   changed: (driven) from 444 to 489
   goals met: 3 of 16
26. (drive-truck truck3 s13 s4 driver2)
   deleted: (at truck3 s13)
   added: (at truck3 s4)
   changed: (driven) from 489 to 514
   goals met: 3 of 16
27. (unload-truck package1 truck3 s4)
   deleted: (in package1 truck3)
   added: (at package1 s4)
   goals met: 4 of 16
28. (unload-truck package7 truck3 s4)
   deleted: (in package7 truck3)
   added: (at package7 s4)
   goals met: 5 of 16
29. (drive-truck truck3 s4 s13 driver2)
   deleted: (at truck3 s4)
   added: (at truck3 s13)
   changed: (driven) from 514 to 539
   goals met: 5 of 16
30. (drive-truck truck4 s8 s7 driver3)
   deleted: (at truck4 s8)
   added: (at truck4 s7)
   changed: (driven) from 539 to 545
   goals met: 5 of 16
31. (unload-truck package9 truck4 s7)
   deleted: (in package9 truck4)
   added: (at package9 s7)
   goals met: 6 of 16
32. (drive-truck truck4 s7 s6 driver3)
   deleted: (at truck4 s7)
   added: (at truck4 s6)
   changed: (driven) from 545 to 589
   goals met: 6 of 16
33. (unload-truck package6 truck4 s6)
   deleted: (in package6 truck4)
   added: (at package6 s6)
   goals met: 7 of 16
34. (disembark-truck driver2 truck3 s13)
   deleted: (driving driver2 truck3)
   added: (at driver2 s13) (empty truck3)
   goals met: 8 of 16
35. (unload-truck package8 truck3 s13)
   deleted: (in package8 truck3)
   added: (at package8 s13)
   goals met: 8 of 16
36. (board-truck driver2 truck3 s13)
   deleted: (at driver2 s13) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 7 of 16
37. (drive-truck truck3 s13 s3 driver2)
   deleted: (at truck3 s13)
   added: (at truck3 s3)
   changed: (driven) from 589 to 604
   goals met: 8 of 16
38. (drive-truck truck4 s6 s8 driver3)
   deleted: (at truck4 s6)
   added: (at truck4 s8)
   changed: (driven) from 604 to 608
   goals met: 8 of 16
39. (drive-truck truck3 s3 s13 driver2)
   deleted: (at truck3 s3)
   added: (at truck3 s13)
   changed: (driven) from 608 to 623
   goals met: 7 of 16
40. (load-truck package8 truck3 s13)
   deleted: (at package8 s13)
   added: (in package8 truck3)
   goals met: 7 of 16
41. (drive-truck truck3 s13 s3 driver2)
   deleted: (at truck3 s13)
   added: (at truck3 s3)
   changed: (driven) from 623 to 638
   goals met: 8 of 16
42. (drive-truck truck4 s8 s2 driver3)
   deleted: (at truck4 s8)
   added: (at truck4 s2)
   changed: (driven) from 638 to 700
   goals met: 8 of 16
43. (drive-truck truck3 s3 s1 driver2)
   deleted: (at truck3 s3)
   added: (at truck3 s1)
   changed: (driven) from 700 to 787
   goals met: 7 of 16
44. (unload-truck package8 truck3 s1)
   deleted: (in package8 truck3)
   added: (at package8 s1)
   goals met: 8 of 16
45. (drive-truck truck3 s1 s3 driver2)
   deleted: (at truck3 s1)
   added: (at truck3 s3)
   changed: (driven) from 787 to 874
   goals met: 9 of 16
46. (board-truck driver1 truck1 s11)
   deleted: (at driver1 s11) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 9 of 16
47. (drive-truck truck4 s2 s13 driver3)
   deleted: (at truck4 s2)
   added: (at truck4 s13)
   changed: (driven) from 874 to 941
   goals met: 10 of 16
48. (drive-truck truck3 s3 s13 driver2)
   deleted: (at truck3 s3)
   added: (at truck3 s13)
   changed: (driven) from 941 to 956
   goals met: 9 of 16
49. (disembark-truck driver2 truck3 s13)
   deleted: (driving driver2 truck3)
   added: (at driver2 s13) (empty truck3)
   goals met: 10 of 16
50. (unload-truck package4 truck4 s13)
   deleted: (in package4 truck4)
   added: (at package4 s13)
   goals met: 11 of 16
51. (disembark-truck driver1 truck1 s11)
   deleted: (driving driver1 truck1)
   added: (at driver1 s11) (empty truck1)
   goals met: 11 of 16
52. (drive-truck truck4 s13 s9 driver3)
   deleted: (at truck4 s13)
   added: (at truck4 s9)
   changed: (driven) from 956 to 1002
   goals met: 10 of 16
53. (drive-truck truck4 s9 s12 driver3)
   deleted: (at truck4 s9)
   added: (at truck4 s12)
   changed: (driven) from 1002 to 1047
   goals met: 10 of 16
54. (board-truck driver1 truck1 s11)
   deleted: (at driver1 s11) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 10 of 16
55. (drive-truck truck1 s11 s0 driver1)
   deleted: (at truck1 s11)
   added: (at truck1 s0)
   changed: (driven) from 1047 to 1084
   goals met: 10 of 16
56. (drive-truck truck4 s12 s11 driver3)
   deleted: (at truck4 s12)
   added: (at truck4 s11)
   changed: (driven) from 1084 to 1170
   goals met: 10 of 16
57. (disembark-truck driver3 truck4 s11)
   deleted: (driving driver3 truck4)
   added: (at driver3 s11) (empty truck4)
   goals met: 10 of 16
58. (disembark-truck driver1 truck1 s0)
   deleted: (driving driver1 truck1)
   added: (at driver1 s0) (empty truck1)
   goals met: 11 of 16
59. (board-truck driver3 truck2 s11)
   deleted: (at driver3 s11) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 11 of 16
60. (board-truck driver2 truck3 s13)
   deleted: (at driver2 s13) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 10 of 16
61. (board-truck driver4 truck1 s0)
   deleted: (at driver4 s0) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 10 of 16
62. (drive-truck truck1 s0 s5 driver4)
   deleted: (at truck1 s0)
   added: (at truck1 s5)
   changed: (driven) from 1170 to 1207
   goals met: 11 of 16
63. (drive-truck truck3 s13 s3 driver2)
   deleted: (at truck3 s13)
   added: (at truck3 s3)
   changed: (driven) from 1207 to 1222
   goals met: 12 of 16
64. (drive-truck truck2 s11 s3 driver3)
   deleted: (at truck2 s11)
   added: (at truck2 s3)
   changed: (driven) from 1222 to 1300
   goals met: 12 of 16
65. (drive-truck truck3 s3 s11 driver2)
   deleted: (at truck3 s3)
   added: (at truck3 s11)
   changed: (driven) from 1300 to 1378
   goals met: 11 of 16
66. (disembark-truck driver2 truck3 s11)
   deleted: (driving driver2 truck3)
   added: (at driver2 s11) (empty truck3)
   goals met: 11 of 16
67. (board-truck driver2 truck4 s11)
   deleted: (at driver2 s11) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 11 of 16
68. (drive-truck truck4 s11 s13 driver2)
   deleted: (at truck4 s11)
   added: (at truck4 s13)
   changed: (driven) from 1378 to 1473
   goals met: 12 of 16
69. (disembark-truck driver2 truck4 s13)
   deleted: (driving driver2 truck4)
   added: (at driver2 s13) (empty truck4)
   goals met: 13 of 16
70. (walk driver2 s13 p11-13)
   deleted: (at driver2 s13)
   added: (at driver2 p11-13)
   changed: (walked) from 84 to 147
   goals met: 12 of 16
71. (walk driver2 p11-13 s11)
   deleted: (at driver2 p11-13)
   added: (at driver2 s11)
   changed: (walked) from 147 to 148
   goals met: 12 of 16
72. (board-truck driver2 truck3 s11)
   deleted: (at driver2 s11) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 12 of 16
73. (drive-truck truck3 s11 s13 driver2)
   deleted: (at truck3 s11)
   added: (at truck3 s13)
   changed: (driven) from 1473 to 1568
   goals met: 12 of 16
74. (disembark-truck driver3 truck2 s3)
   deleted: (driving driver3 truck2)
   added: (at driver3 s3) (empty truck2)
   goals met: 12 of 16
75. (drive-truck truck3 s13 s3 driver2)
   deleted: (at truck3 s13)
   added: (at truck3 s3)
   changed: (driven) from 1568 to 1583
   goals met: 13 of 16
76. (walk driver3 s3 p12-3)
   deleted: (at driver3 s3)
   added: (at driver3 p12-3)
   changed: (walked) from 148 to 171
   goals met: 13 of 16
77. (walk driver3 p12-3 s12)
   deleted: (at driver3 p12-3)
   added: (at driver3 s12)
   changed: (walked) from 171 to 178
   goals met: 14 of 16
78. (disembark-truck driver2 truck3 s3)
   deleted: (driving driver2 truck3)
   added: (at driver2 s3) (empty truck3)
   goals met: 14 of 16
79. (board-truck driver2 truck2 s3)
   deleted: (at driver2 s3) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 14 of 16
80. (drive-truck truck2 s3 s5 driver2)
   deleted: (at truck2 s3)
   added: (at truck2 s5)
   changed: (driven) from 1583 to 1611
   goals met: 15 of 16
81. (disembark-truck driver2 truck2 s5)
   deleted: (driving driver2 truck2)
   added: (at driver2 s5) (empty truck2)
   goals met: 15 of 16
82. (walk driver2 s5 p5-13)
   deleted: (at driver2 s5)
   added: (at driver2 p5-13)
   changed: (walked) from 178 to 268
   goals met: 15 of 16
83. (walk driver2 p5-13 s13)
   deleted: (at driver2 p5-13)
   added: (at driver2 s13)
   changed: (walked) from 268 to 301
   goals met: 16 of 16
